---
type: PointLoad
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 7
tags: [revit-api, class]
---

# PointLoad

`Autodesk.Revit.DB.Structure.PointLoad` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | — | `` |
| Method | IsPointInsideHostBoundaries | 2024 | `public static bool IsPointInsideHostBoundaries ( Document pDoc , ElementId hostId , XYZ point )` |
| Method | IsValidHostId | 2023 | `public static bool IsValidHostId ( Document pDoc , ElementId hostId )` |
| Property | ForceVector | 2016 | `public XYZ ForceVector { get ; set ; }` |
| Property | MomentVector | 2016 | `public XYZ MomentVector { get ; set ; }` |
| Property | Parameter | — | `` |
| Property | Point | 2016 | `public XYZ Point { get ; set ; }` |